#include <iostream>
using namespace std;
int main() {
	setlocale(LC_CTYPE, "Russian");
	int a, b, p, q, r, s;
	cout << "Введите размеры участка = "; cin >> a >> b;
	cout << "Введите размеры первого дома = "; cin >> p >> q;	//Вводим данные 
	cout << "Введите размеры второго дома = "; cin >> r >> s;
	if (p + r <= a && q + s <= b || p + r <= b && q + s <= a ||				//Вводим все варианты которые 
		p + s <= a && q + r <= b || p + s <= b && q + r <= a) {				//позволяют произвсети застройку
		cout << "Застройка возможна.";							//Вывод при удовлетворения условия
	}
	else {
		cout << "Застройка невозможна.";							//Вывод при неудовлетворения условия
	}
}